EDT/УТ/src/Catalogs/КлассификаторИспользованияРабочегоВремени/КлассификаторИспользованияРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторИспользованияРабочегоВремени</name>
  <comment>(Регл)</comment>
  <predefined>
    <items>
      <name>ВыходныеДни</name>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоРазрешениюРаботодателя</name>
      <description>БезОпл</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоЗаконодательству</name>
      <description>БезОпл</description>
    </items>
    <items>
      <name>НеоплачиваемыйДополнительныйОтпуск</name>
      <description>БезОпл</description>
    </items>
    <items>
      <name>ОтпускПоБеременностиИРодам</name>
      <description>Бер-ть</description>
    </items>
    <items>
      <name>Болезнь</name>
      <description>Болезнь</description>
    </items>
    <items>
      <name>БолезньБезОплаты</name>
      <description>Болезнь</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниНеОплачиваемые</name>
      <description>Выход-е</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниОплачиваемые</name>
      <description>Выход-е</description>
    </items>
    <items>
      <name>ДополнительныйОтпуск</name>
      <description>ДОтпуск</description>
    </items>
    <items>
      <name>Забастовка</name>
      <description>Забасто</description>
    </items>
    <items>
      <name>ЗадержкаВыплатыЗаработнойПлаты</name>
      <description>Задержк</description>
    </items>
    <items>
      <name>ПовышениеКвалификации</name>
      <description>Кв-ия</description>
    </items>
    <items>
      <name>ПовышениеКвалификацииВДругойМестности</name>
      <description>Кв-ия</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>Ком-ка</description>
    </items>
    <items>
      <name>НеявкиПоНевыясненнымПричинам</name>
      <description>Неявки </description>
    </items>
    <items>
      <name>ОтпускНаОбучениеНеоплачиваемый</name>
      <description>Обуч-ие</description>
    </items>
    <items>
      <name>ОтпускНаОбучение</name>
      <description>Обуч-ие</description>
    </items>
    <items>
      <name>ГосударственныеОбязанности</name>
      <description>Обяз-ти</description>
    </items>
    <items>
      <name>ОсновнойОтпуск</name>
      <description>Отпуск</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыБезОплаты</name>
      <description>Отстр-е</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыСОплатой</name>
      <description>Отстр-е</description>
    </items>
    <items>
      <name>ОтпускПоУходуЗаРебенком</name>
      <description>ПоУходу</description>
    </items>
    <items>
      <name>ВынужденныйПрогул</name>
      <description>Прогул</description>
    </items>
    <items>
      <name>Прогулы</name>
      <description>Прогулы</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботодателя</name>
      <description>Простой</description>
    </items>
    <items>
      <name>Простой</name>
      <description>Простой</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботника</name>
      <description>Простой</description>
    </items>
    <items>
      <name>Работа</name>
      <description>Работа </description>
    </items>
    <items>
      <name>РаботаВечерниеЧасы</name>
      <description>Работа</description>
    </items>
    <items>
      <name>РаботаНочныеЧасы</name>
      <description>Работа</description>
    </items>
    <items>
      <name>Сверхурочные</name>
      <description>Работа</description>
    </items>
    <items>
      <name>Праздники</name>
      <description>Работа</description>
    </items>
    <items>
      <name>Уволен</name>
      <description>Уволен</description>
    </items>
  </predefined>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидВремени</name>
    <type>
      <types>EnumRef.ВидыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Enums/ВидыВремени/ВидыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВремени</name>
  <enumValues>
    <name>ОтработанноеВПределахНормы</name>
    <comment>Начисление за работу полную рабочую смену в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ОтработанноеСверхНормы</name>
    <comment>Начисление за работу сверх нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЦелодневноеНеотработанное</name>
    <comment>Неотработанные полные смены</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеНеотработанное</name>
    <comment>Неотработанные неполные смены</comment>
  </enumValues>
  <enumValues>
    <name>ДополнительноОплачиваемоеВПределахНормы</name>
    <comment>Дополнительное начисление в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеОтработанноеВПределахНормы</name>
    <comment>Начисление за работу неполную смену в пределах нормы времени</comment>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/КлассификаторИспользованияРабочегоВремени/ManagerModule.bsl
// Выполняет заполнение справочника "КлассификаторИспользованияРабочегоВремени" 
//
Процедура ЗаполнитьКлассификаторИспользованияРабочегоВремени() Экспорт

	// Установка реквизитов предопределенных элементов
	ВремяОтработанноеВПределахНормы = Перечисления.ВидыВремени.ОтработанноеВПределахНормы;
	ВремяДополнительноОплачиваемоеВПределахНормы = Перечисления.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы;
	ВремяОтработанноеСверхНормы = Перечисления.ВидыВремени.ОтработанноеСверхНормы;
	ВремяЦелодневноеНеотработанное = Перечисления.ВидыВремени.ЦелодневноеНеотработанное;
	ВремяЧасовоеНеотработанное = Перечисления.ВидыВремени.ЧасовоеНеотработанное;
	
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни.ПолучитьОбъект(),									"В", "26", "Выходные дни",							"Выходные дни (еженедельный отпуск) и  нерабочие праздничные дни",Перечисления.ВидыВремени.ПустаяСсылка());
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.Работа.ПолучитьОбъект(),										"Я", "01", "Явка",									"Продолжительность работы в дневное время", ВремяОтработанноеВПределахНормы,Истина);
	
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.Командировка.ПолучитьОбъект(),									"К", "06", "Командировка",							"Служебная командировка",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификации.ПолучитьОбъект(),						"ПК","07", "Повышение квалификации",				"Повышение квалификации с отрывом от работы",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификацииВДругойМестности.ПолучитьОбъект(),		"ПМ","08", "Повышение квалификации в другой местности",		"Повышение квалификации с отрывом от работы в другой местности",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск.ПолучитьОбъект(),								"ОТ","09", "Отпуск",								"Ежегодный основной оплачиваемый отпуск",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск.ПолучитьОбъект(),							"ОД","10", "Дополнительный отпуск",					"Ежегодный дополнительный оплачиваемый отпуск",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение.ПолучитьОбъект(),								"У", "11", "Отпуск дополнительный (оплачиваемый учебный)",	"Дополнительный отпуск в связи с обучением с сохранением среднего заработка работникам, совмещающим работу с обучением",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый.ПолучитьОбъект(),				"УД","13", "Отпуск дополнительный (неоплачиваемый учебный)",	"Дополнительный отпуск в связи с обучением без сохранения заработной платы",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам.ПолучитьОбъект(),					"Р", "14", "Отпуск по беременности и родам",			"Отпуск по беременности и родам (отпуск в связи с усыновлением новорожденного ребенка)",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком.ПолучитьОбъект(),						"ОЖ","15", "Отпуск по уходу за ребенком",			"Отпуск по уходу за ребенком до достижения им возраста трех лет",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя.ПолучитьОбъект(),	"ДО","16", "Отпуск неоплачиваемый с разрешения работодателя",	"Отпуск без сохранения заработной платы, предоставляемый работнику по разрешению работодателя",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоЗаконодательству.ПолучитьОбъект(),		"ОЗ","17", "Отпуск неоплачиваемый в соответствии с законом",	"Отпуск без сохранения заработной платы в случаях, предусмотренных законодательством",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйДополнительныйОтпуск.ПолучитьОбъект(),			"ДБ","18", "Доп.отпуск без сохранения заработной платы",	"Ежегодный дополнительный отпуск без сохранения заработной платы",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь.ПолучитьОбъект(),										"Б ","19", "Больничный",							"Временная нетрудоспособность с назначением пособия согласно законодательству",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты.ПолучитьОбъект(),								"Т", "20", "Больничный неоплачиваемый",				"Временная нетрудоспособность без назначения пособия в случаях, предусмотренных законодательством",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ВынужденныйПрогул.ПолучитьОбъект(),							"ПВ","22", "Время вынужденного прогула",			"Время вынужденного прогула в случае признания увольнения, перевода на другую работу или отстранения от работы незаконными с восстановлением на прежней работе",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности.ПолучитьОбъект(),					"Г", "23", "Выполнение государственных обязанностей",		"Невыходы на время исполнения государственных или общественных обязанностей согласно законодательству",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.Прогулы.ПолучитьОбъект(),										"ПР","24", "Прогул",								"Прогулы (отсутствие на рабочем месте без уважительных причин в течение времени, установленного законодательством)",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ДополнительныеВыходныеДниОплачиваемые.ПолучитьОбъект(),		"ОВ","27", "Дополнительные выходные дни (оплачиваемые)",	"Дополнительные выходные дни (оплачиваемые)",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ДополнительныеВыходныеДниНеОплачиваемые.ПолучитьОбъект(),		"НВ","28", "Дополнительные выходные дни (неоплачиваемые)",	"Дополнительные выходные дни (без сохранения заработной платы)",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.Забастовка.ПолучитьОбъект(),									"ЗБ","29", "Забастовка",							"Забастовка (при условиях и в порядке, предусмотренных законом)",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам.ПолучитьОбъект(),					"НН","30", "Неявки по невыясненным причинам",			"Неявки по невыясненным причинам (до выяснения обстоятельств)",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателя.ПолучитьОбъект(),					"РП","31", "Время простоя по вине работодателя",		"Время простоя по вине работодателя",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.Простой.ПолучитьОбъект(),										"НП","32", "Простой, не зависящий от работодателя и работника", "Время простоя по причинам, не зависящим от работодателя и работника",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботника.ПолучитьОбъект(),						"ВП","33", "Простой по вине работника",				"Простои по вине работника",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыСОплатой.ПолучитьОбъект(),					"НО","34", "Отстранение от работы с оплатой",			"Отстранение от работы (недопущение к работе) с оплатой (пособием) в соответствии с законодательством",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыБезОплаты.ПолучитьОбъект(),					"НБ","35", "Отстранение от работы без оплаты",			"Отстранение от работы (недопущение к работе) по причинам, предусмотренным законодательством, без начисления заработной платы",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.ЗадержкаВыплатыЗаработнойПлаты.ПолучитьОбъект(),				"НЗ","36", "Приостановка работы в случае задержки выплаты з/п", "Время приостановки работы в случае задержки выплаты заработной платы",ВремяЦелодневноеНеотработанное);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы.ПолучитьОбъект(),								"Н ","02", "Ночные часы",							"Продолжительность работы в ночное время",ВремяДополнительноОплачиваемоеВПределахНормы,Истина);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы.ПолучитьОбъект(),							"ВЧ","41", "Вечерние часы",							"Продолжительность работы в вечернее время",ВремяДополнительноОплачиваемоеВПределахНормы,Истина);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные.ПолучитьОбъект(),									"С ","04", "Сверхурочно",							"Продолжительность сверхурочной работы",ВремяОтработанноеСверхНормы, Истина);
	ОписатьКодИспользованияРабочегоВремени(Справочники.КлассификаторИспользованияРабочегоВремени.Праздники.ПолучитьОбъект(),									"РВ","03", "Праздники",								"Продолжительность работы в выходные и нерабочие, праздничные дни", ВремяОтработанноеСверхНормы, Истина);

	// Создание остальных элементов классификатора
	ДобавитьКодИспользованияРабочегоВремени("ВМ","05", "Вахта", "Продолжительность работы вахтовым методом",ВремяОтработанноеВПределахНормы,Истина);
	ДобавитьКодИспользованияРабочегоВремени("УВ","12", "Сокр.время обучающихся без отрыва от производства", "Сокращенная продолжительность рабочего для обучающихся без отрыва от производства с частичным сохранением заработной платы",ВремяОтработанноеВПределахНормы,Истина);
	ДобавитьКодИспользованияРабочегоВремени("ЛЧ","21", "Сокращенное рабочее время в соответствии с законом", "Сокращенная продолжительность рабочего времени против нормальной продолжительности рабочего дня в случаях, предусмотренных законодательством",ВремяОтработанноеВПределахНормы,Истина);
	ДобавитьКодИспользованияРабочегоВремени("НС","25", "Работа в режиме неполного рабочего времени", "Продолжительность работы в режиме неполного рабочего времени по инициативе работодателя в случаях, предусмотренных законодательством",ВремяОтработанноеВПределахНормы,Истина);

КонецПроцедуры


// Добавляет в справочник "КлассификаторИспользованияРабочегоВремени" новый элемент
//
Процедура ОписатьКодИспользованияРабочегоВремени(КодИспользованияРабочегоВремени, Знач БуквенныйКод, Знач  ЦифровойКод, Знач  Наименование = Неопределено, Знач  ПолноеНаименование, ВидВремени, РабочееВремя = Неопределено) Экспорт

	Если КодИспользованияРабочегоВремени.БуквенныйКод <> СокрЛП(БуквенныйКод) Тогда
		КодИспользованияРабочегоВремени.БуквенныйКод = СокрЛП(БуквенныйКод);
	КонецЕсли;
	Если КодИспользованияРабочегоВремени.ЦифровойКод <> СокрЛП(ЦифровойКод) Тогда
		КодИспользованияРабочегоВремени.ЦифровойКод  = СокрЛП(ЦифровойКод);
	КонецЕсли;
	Если КодИспользованияРабочегоВремени.ПолноеНаименование <> СокрЛП(ПолноеНаименование) Тогда
		КодИспользованияРабочегоВремени.ПолноеНаименование = СокрЛП(ПолноеНаименование);
	КонецЕсли;
	Если КодИспользованияРабочегоВремени.Наименование <> СокрЛП(Наименование) Тогда
		КодИспользованияРабочегоВремени.Наименование = СокрЛП(Наименование);
	КонецЕсли;
	Если РабочееВремя <> Неопределено Тогда
		КодИспользованияРабочегоВремени.РабочееВремя = РабочееВремя;
	КонецЕсли;
	Если КодИспользованияРабочегоВремени.Модифицированность() Тогда
		КодИспользованияРабочегоВремени.Записать();
	КонецЕсли;
	
КонецПроцедуры


// Добавляет в справочник "КлассификаторИспользованияРабочегоВремени" новый элемент
//
Процедура ДобавитьКодИспользованияРабочегоВремени(Знач БуквенныйКод, Знач  ЦифровойКод, Знач  Наименование = Неопределено, Знач  ПолноеНаименование, ВидВремени, РабочееВремя = Неопределено)

	ЦифровойКод    = СокрЛП(ЦифровойКод);
	СсылкаНаЭлемент = Справочники.КлассификаторИспользованияРабочегоВремени.НайтиПоРеквизиту("ЦифровойКод", ЦифровойКод);

	Если  СсылкаНаЭлемент.Пустая() Тогда
		Элемент              = Справочники.КлассификаторИспользованияРабочегоВремени.СоздатьЭлемент();
	 	Элемент.ЦифровойКод  = СокрЛП(ЦифровойКод);
	Иначе
		Элемент = СсылкаНаЭлемент.ПолучитьОбъект();
	КонецЕсли;

	Элемент.БуквенныйКод = СокрЛП(БуквенныйКод);
	Элемент.ПолноеНаименование = СокрЛП(ПолноеНаименование);
	Элемент.Наименование = СокрЛП(?(Наименование = Неопределено,ПолноеНаименование,Наименование));
	//Элемент.ВидВремени = ВидВремени;
	Если РабочееВремя <> Неопределено Тогда
		Элемент.РабочееВремя = РабочееВремя;
	КонецЕсли;
	Элемент.Записать();

КонецПроцедуры
